const GradCategories = {
  type: '01',
  typeName: '졸업작품',
  categories: [
    {
      id: '0101',
      name: '인문학',
      subCategories: [
        { id: '010101', name: '인문학일반' },
        { id: '010102', name: '역사학' },
        { id: '010103', name: '철학' },
        { id: '010104', name: '종교학/신학' },
        { id: '010105', name: '언어학' },
        { id: '010106', name: '문학' },
        { id: '010107', name: '한국어문학' },
        { id: '010108', name: '중국어문학' },
        { id: '010109', name: '일본어문학' },
        { id: '010110', name: '영어문학' },
        { id: '010111', name: '프랑스어문학' },
        { id: '010112', name: '독일어문학' },
        { id: '010113', name: '러시아어문학' }
      ]
    },
    {
      id: '0102',
      name: '사회과학',
      subCategories: [
        { id: '010201', name: '사회과학일반' },
        { id: '010202', name: '정치외교학' },
        { id: '010203', name: '경제학' },
        { id: '010204', name: '경영학' },
        { id: '010205', name: '무역학' },
        { id: '010206', name: '사회학' },
        { id: '010207', name: '사회복지학' },
        { id: '010208', name: '지역학' },
        { id: '010209', name: '교육학' },
        { id: '010210', name: '법학' },
        { id: '010211', name: '행정학' },
        { id: '010212', name: '지리/지역개발학' },
        { id: '010213', name: '관광학' },
        { id: '010214', name: '신문방송학' },
        { id: '010215', name: '군사학' },
        { id: '010216', name: '심리과학' },
        { id: '010217', name: '문헌정보학' }
      ]
    },
    {
      id: '0103',
      name: '자연과학',
      subCategories: [
        { id: '010301', name: '자연과학일반' },
        { id: '010302', name: '수학/통계학' },
        { id: '010303', name: '물리학' },
        { id: '010304', name: '생물학' },
        { id: '010305', name: '천문/지구과학' },
        { id: '010306', name: '생활과학' }
      ]
    },
    {
      id: '0104',
      name: '공학',
      subCategories: [
        { id: '010401', name: '공학일반' },
        { id: '010402', name: '기계공학' },
        { id: '010403', name: '항공우주공학' },
        { id: '010404', name: '컴퓨터학' },
        { id: '010405', name: '화학/생물공학' },
        { id: '010406', name: '전기/제어계측공학' },
        { id: '010407', name: '토목/환경공학' },
        { id: '010408', name: '전자/정보통신공학' },
        { id: '010409', name: '건축공학' },
        { id: '010410', name: '산업공학' },
        { id: '010411', name: '조선/해양공학' },
        { id: '010412', name: '자원/재료공학' }
      ]
    },
    {
      id: '0105',
      name: '예술체육학',
      subCategories: [
        { id: '010501', name: '예술체육학일반' },
        { id: '010502', name: '음악' },
        { id: '010503', name: '미술' },
        { id: '010504', name: '디자인' },
        { id: '010505', name: '의상' },
        { id: '010506', name: '사진' },
        { id: '010507', name: '미용' },
        { id: '010508', name: '연극' },
        { id: '010509', name: '영화' },
        { id: '010510', name: '체육' },
        { id: '010511', name: '무용' }
      ]
    },
    {
      id: '0106',
      name: '기타',
      subCategories: [
        { id: '010601', name: '의약학' },
        { id: '010602', name: '농수해양학' },
        { id: '010603', name: '교육' },
        { id: '010604', name: '과학기술학/기술정책' },
        { id: '010605', name: '여성학' },
        { id: '010606', name: '뇌/인지과학' },
        { id: '010607', name: '학제간연구' }
      ]
    }
  ]
};

export default GradCategories;
